% Дані: X1 трафік, Х2 підключення, У класи
X = [300 15;
280 18;
800 5;
850 4];
Y = [1; 1; 2; 2];
1% Лінійний дискримінантний аналіз
IdaModel fitcdiscr(X, Y);
% Вивід коефіцієнтів
disp('Коефіцієнти дискримінантної функції:');
disp(ldaModel.Coeffs (1,2).Linear);
% Візуалізація
gscatter (X(:,1), x(:,2), Y, 'rb', 'xo');
xlabel('Трафік'); ylabel('Підключення');
title('Лінійний дискримінантний аналіз');
% Побудова межі
hold on;
K = ldaModel.Coeffs (1,2).Linear;
f = @(x1,x2) K(1)*x1+ K(2)*x2+ 1daModel.Coeffs (1,2).Const;
fimplicit(f, [200 900 0 25], 'k--');
legend("Смартфони', 'ПК', 'Межа');
hold off;
Коефіцієнти дискримінантної функції:
-0.9538
-5.6923
